Revit 2024 API
DetailCurveArrayIterator Class
An iterator to a array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class DetailCurveArrayIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class DetailCurveArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class DetailCurveArrayIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DetailCurveArrayIterator
See Also
DetailCurveArrayIterator Members
Autodesk.Revit.DB Namespace